Autodesk.Revit.DB.Structure.ISteelConnectionsServerProxy.GenerateGraphics(Autodesk.Revit.DB.Structure.SteelConnectionsServiceData)
The server's method that will be called when NOBLE needs graphics information for connections.
The input and output data of the calculation.
Indicates whether the graphics generation was executed successfully.
Remarks:
The method should always return 'true' if the server is successfully executed, no matter whether the server changes anything.
Return 'false' or if the server throws, indicates a failed case, all changes made by the server will be discarded.
Since:
2017